#include <stdio.h>
#include <string.h>
#include <stdlib.h> 

#define N 100

struct entry {
  char used;      /* 1 υπό χρήση, 0 ελεύθερο */
  char name[64];  /* όνομα ως αλφαριθμητικό */
  char phone[64]; /* τηλέφωνο ως αλφαριθμητικό */
};

struct entry entries[N];

void contact_init(); 
/* αρχικοποιεί τις καθολικές μεταβλητές 
   ή/και δομές δεδομένων του προγράμματος.
   Γεμίζει τον πίνακα των εγγραφών με τα
   δεδομένα του αρχείου fContacts */

int contact_find(const char name[], char phone[]);
/* δέχεται σαν πρώτη παράμετρο ένα αλφαριθμητικό όνομα και
   αποθηκεύει στην δεύτερη παράμετρο το αντίστοιχο τηλέφωνο,
   επιστρέφοντας 1 για επιτυχία και 0 για αποτυχία */

void contact_rmv(const char name[]);
/* δέχεται σαν παράμετρο ένα αλφαριθμητικό όνομα και
   "απομακρύνει" την αντίστοιχη εγγραφή, αν υπάρχει */

int contact_add_or_repl(const char name[], const char phone[]);
/* επιχειρεί να εισάγει μια νέα εγγραφή με το όνομα και
   τηλέφωνο που δίνονται σαν παράμετροι, και επιστρέφει
   1 για επιτυχία, 0 για αποτυχία λόγω έλλειψης χώρου 
   και -1 για αντικατάσταση υπάρχουσας εγγραφής */

long internal_find(const char name[]);
/* επιστρέφει τη θέση μιας επαφής με το όνομα name
ή Ν αν δεν υπάρχει */

void save_on_exit();
/* αποθηκεύει τα δεδομένα του πίνακα επαφών στο αρχείο fContacts */

void print_mfcontacts();
/* εμφάνιση περιεχομένων πίνακα δομών και αρχείου
επαφών fContacts */