#include <stdio.h>
#include <string.h>

int main(int argc, char *argv[]) {
    FILE *f; 
    char s[64];

    f = fopen(argv[1],"w"); /* Άνοιγμα για γράψιμο του αρχείου που δίνεται στη γραμμή εντολών */

    /* Ανάγνωση συμβολοσειρών από το πληκτρολόγιο και εγγραφή αε 
    αρχείο κειμένου έως ότου πληκτρολογηθεί end*/
    do {
        scanf("%63s",s);
        printf("%s\n", s);
        fprintf(f,"%s ",s); //Εγγραφή συμβολοσειράς στο αρχείο
    } while (strcmp(s,"end"));

    fflush(f); 
    fclose(f); // Κλείσιμο του αρχείου

    f = fopen(argv[1],"r"); //Άνοιγμα του αρχείου για ανάγνωση
    
    /* Διάβασμα και εμφάνιση των περιεχομένων έως το τέλος αρχείου */
    while (!feof(f)) { 
        fscanf(f,"%63s ",s);
        printf("%s\n",s);
    }
    fclose(f); //Κλείσιμο αρχείου

}
